documentation.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Documentation for the client side "portal" page</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Documentation for the client side "portal" page"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-26 16:53:06 BST"/>
<meta name="author" content="Steve Jordan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Documentation for the client side "portal" page</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Architechture</a></li>
<li><a href="#sec-2">2 Codebase</a>
<ul>
<li><a href="#sec-2-1">2.1 models</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1 Person</a></li>
<li><a href="#sec-2-1-2">2.1.2 Course</a></li>
<li><a href="#sec-2-1-3">2.1.3 Book</a></li>
<li><a href="#sec-2-1-4">2.1.4 Hold</a></li>
<li><a href="#sec-2-1-5">2.1.5 Fine</a></li>
<li><a href="#sec-2-1-6">2.1.6 CalendarItem</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2 collections</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1 CoursesCollection</a></li>
<li><a href="#sec-2-2-2">2.2.2 BooksCollection</a></li>
<li><a href="#sec-2-2-3">2.2.3 HoldsCollection</a></li>
<li><a href="#sec-2-2-4">2.2.4 FinesCollection</a></li>
<li><a href="#sec-2-2-5">2.2.5 AbstractCollection</a></li>
<li><a href="#sec-2-2-6">2.2.6 LibraryCollection</a></li>
<li><a href="#sec-2-2-7">2.2.7 Calendar</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3 views</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1 FakePortalView</a></li>
<li><a href="#sec-2-3-2">2.3.2 PersonView</a></li>
<li><a href="#sec-2-3-3">2.3.3 CourseView</a></li>
<li><a href="#sec-2-3-4">2.3.4 BookView</a></li>
<li><a href="#sec-2-3-5">2.3.5 HoldView</a></li>
<li><a href="#sec-2-3-6">2.3.6 FineView</a></li>
<li><a href="#sec-2-3-7">2.3.7 CalendarView</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3">3 Data sources</a>
<ul>
<li><a href="#sec-3-1">3.1 moodle</a></li>
<li><a href="#sec-3-2">3.2 millenium</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Future data sources</a></li>
<li><a href="#sec-5">5 git setup</a></li>
<li><a href="#sec-6">6 Advantages to client side aproach</a>
<ul>
<li><a href="#sec-6-1">6.1 Standards</a></li>
<li><a href="#sec-6-2">6.2 skills</a></li>
<li><a href="#sec-6-3">6.3 Development environment</a></li>
<li><a href="#sec-6-4">6.4 Quick to iterate</a></li>
<li><a href="#sec-6-5">6.5 Mobile ready</a></li>
<li><a href="#sec-6-6">6.6 Loose coupling</a></li>
<li><a href="#sec-6-7">6.7 SSO</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Architechture</h2>
<div class="outline-text-2" id="text-1">

<p>  From back to front end.
</p>
<ol>
<li>Source &ndash;&gt; 
<ol>
<li>php on webapps &ndash;&gt; 
<ol>
<li>Matrix rest resource &ndash;&gt;
<ol>
<li>backbone.js on client
</li>
</ol>

</li>
</ol>

</li>
</ol>

</li>
</ol>


<p>
  the client side script (4) makes a request to matrix (3) (to obey
  same domain restrictions - this might become Apache proxying in
  future), which makes a request to a php resource (2) on
  webapps.city, which is responsible for getting and caching the
  source data (1).
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Codebase</h2>
<div class="outline-text-2" id="text-2">

<p>  The frontend is done using <a href="http://backbonejs.org/">backbone.js</a>, which is an MV*
  framework. It organises the code into models, collections and
  views. The view is where the majority of the work is done. So far we
  have the following models, collections and views:
</p>
</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> models</h3>
<div class="outline-text-3" id="text-2-1">


</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Person</h4>
<div class="outline-text-4" id="text-2-1-1">

<p>    currently unused, will eventually need to grab data from AD,
    evision, moodle etc.
</p></div>

</div>

<div id="outline-container-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Course</h4>
<div class="outline-text-4" id="text-2-1-2">

<p>    a course from moodle
</p></div>

</div>

<div id="outline-container-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> Book</h4>
<div class="outline-text-4" id="text-2-1-3">

<p>    a book currently on loan from a library
</p></div>

</div>

<div id="outline-container-2-1-4" class="outline-4">
<h4 id="sec-2-1-4"><span class="section-number-4">2.1.4</span> Hold</h4>
<div class="outline-text-4" id="text-2-1-4">

<p>    a book hold requested from a library
</p></div>

</div>

<div id="outline-container-2-1-5" class="outline-4">
<h4 id="sec-2-1-5"><span class="section-number-4">2.1.5</span> Fine</h4>
<div class="outline-text-4" id="text-2-1-5">

<p>    a library fine, historical or due
</p></div>

</div>

<div id="outline-container-2-1-6" class="outline-4">
<h4 id="sec-2-1-6"><span class="section-number-4">2.1.6</span> CalendarItem</h4>
<div class="outline-text-4" id="text-2-1-6">

<p>    a (moodle currently) calendar entry
</p>
</div>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> collections</h3>
<div class="outline-text-3" id="text-2-2">

<p>   all groupings of instances of the above models
</p>
</div>

<div id="outline-container-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> CoursesCollection</h4>
<div class="outline-text-4" id="text-2-2-1">

</div>

</div>

<div id="outline-container-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> BooksCollection</h4>
<div class="outline-text-4" id="text-2-2-2">

</div>

</div>

<div id="outline-container-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> HoldsCollection</h4>
<div class="outline-text-4" id="text-2-2-3">

</div>

</div>

<div id="outline-container-2-2-4" class="outline-4">
<h4 id="sec-2-2-4"><span class="section-number-4">2.2.4</span> FinesCollection</h4>
<div class="outline-text-4" id="text-2-2-4">

</div>

</div>

<div id="outline-container-2-2-5" class="outline-4">
<h4 id="sec-2-2-5"><span class="section-number-4">2.2.5</span> AbstractCollection</h4>
<div class="outline-text-4" id="text-2-2-5">

</div>

</div>

<div id="outline-container-2-2-6" class="outline-4">
<h4 id="sec-2-2-6"><span class="section-number-4">2.2.6</span> LibraryCollection</h4>
<div class="outline-text-4" id="text-2-2-6">

</div>

</div>

<div id="outline-container-2-2-7" class="outline-4">
<h4 id="sec-2-2-7"><span class="section-number-4">2.2.7</span> Calendar</h4>
<div class="outline-text-4" id="text-2-2-7">


</div>
</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> views</h3>
<div class="outline-text-3" id="text-2-3">


</div>

<div id="outline-container-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> FakePortalView</h4>
<div class="outline-text-4" id="text-2-3-1">

<p>    the 'main' view which kicks the app off
</p></div>

</div>

<div id="outline-container-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> PersonView</h4>
<div class="outline-text-4" id="text-2-3-2">

<p>    currently unused
</p></div>

</div>

<div id="outline-container-2-3-3" class="outline-4">
<h4 id="sec-2-3-3"><span class="section-number-4">2.3.3</span> CourseView</h4>
<div class="outline-text-4" id="text-2-3-3">

</div>

</div>

<div id="outline-container-2-3-4" class="outline-4">
<h4 id="sec-2-3-4"><span class="section-number-4">2.3.4</span> BookView</h4>
<div class="outline-text-4" id="text-2-3-4">

</div>

</div>

<div id="outline-container-2-3-5" class="outline-4">
<h4 id="sec-2-3-5"><span class="section-number-4">2.3.5</span> HoldView</h4>
<div class="outline-text-4" id="text-2-3-5">

</div>

</div>

<div id="outline-container-2-3-6" class="outline-4">
<h4 id="sec-2-3-6"><span class="section-number-4">2.3.6</span> FineView</h4>
<div class="outline-text-4" id="text-2-3-6">

</div>

</div>

<div id="outline-container-2-3-7" class="outline-4">
<h4 id="sec-2-3-7"><span class="section-number-4">2.3.7</span> CalendarView</h4>
<div class="outline-text-4" id="text-2-3-7">



</div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Data sources</h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> moodle</h3>
<div class="outline-text-3" id="text-3-1">

<p>   based on work done by Amanda using moodle2 api
</p>
<p>
   Amanda's code is in msm2an0:/web/docs/webapps/moodle/portal
   amends/overloads in msm2an0:/web/docs/webapps/matrix/services/portal-poc/index.php
   These should be merged into better structured php
</p>
<p>
   url Matrix hits is webapps.test.city.ac.uk/matrix/portal-poc/index.php
</p>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> millenium</h3>
<div class="outline-text-3" id="text-3-2">

<p>   using UQL<sub>Millenium</sub> classes to structure the liasing with millenuim api
   work done in msm2an0:/web/docs/webapps/matrix/services/portal-poc/millenium-uql.php
</p>
<p>
   Lucy Clifford's test account is under her username sbbb134
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Future data sources</h2>
<div class="outline-text-2" id="text-4">


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> git setup</h2>
<div class="outline-text-2" id="text-5">

<p>  We have a central repo served from
  msman0:/web/ci/git-repos/fkeportal.git master on this is the one to
  push/pull from.
</p>
<p>
  There is a live version of the app hosted on mam2an0 (webapps.test)
  viewable at <a href="#webapps.test.city.ac.uk-portal-poc">webapps.test.city.ac.uk/portal-poc</a>
</p>
<p>
  To update this you need to log into msm2an0.unix2.test as s1sync
  and:
</p>



<pre class="src src-sh"><span style="font-weight: bold;">cd</span> /web/docs/webapps/portal-poc
git pull
</pre>



</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Advantages to client side aproach</h2>
<div class="outline-text-2" id="text-6">



</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Standards</h3>
<div class="outline-text-3" id="text-6-1">

<p>   open web standards that are practised by a large pool of
   people. Which could quickly and cheaply lead to team expansion with
   contractors/extra headcount.
</p></div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> skills</h3>
<div class="outline-text-3" id="text-6-2">

<p>   in house dev expertise can already handle the work.
</p></div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Development environment</h3>
<div class="outline-text-3" id="text-6-3">

<p>   no expensive software needed (in contrast to RAD), only requires a
   lightweight local dev environment - no compilation stage.
</p></div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> Quick to iterate</h3>
<div class="outline-text-3" id="text-6-4">

<p>   ideas can very cheaply be worked up and tested.
</p></div>

</div>

<div id="outline-container-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> Mobile ready</h3>
<div class="outline-text-3" id="text-6-5">

<p>   small screen display baked in from the start
</p></div>

</div>

<div id="outline-container-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> Loose coupling</h3>
<div class="outline-text-3" id="text-6-6">

<p>   it is very loosely coupled with Matrix and could easily sit
   directly in front of Moodle, or another backend system.
</p></div>

</div>

<div id="outline-container-6-7" class="outline-3">
<h3 id="sec-6-7"><span class="section-number-3">6.7</span> SSO</h3>
<div class="outline-text-3" id="text-6-7">

<p>   only depends on which backend system it serves. If the backend is
   setup to accept it, it will work.
</p></div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-10-26 16:53:06 BST</p>
<p class="author">Author: Steve Jordan</p>
<p class="creator">Org version 7.8.06 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
